[
  {
    "image": "/discord.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 1,
    "description": "Discord is more than just a chat app — it’s a digital space designed for communities, gamers, students, and professionals alike. What started as a way for friends to talk while gaming has evolved into a platform where millions of people build their own spaces to connect. Users can join servers based on their interests, from art and coding to study groups and fandoms. Each server can host multiple channels for text, voice, or video communication, creating an organized yet dynamic environment. High-quality voice chat ensures seamless conversations, while integrations with bots and tools bring automation, entertainment, and productivity all in one place.\n\nBeyond communication, Discord focuses on belonging. It supports custom emojis, roles, and permissions that allow communities to reflect their unique personalities. The Stage Channels feature enables live audio discussions and events, while screen sharing and video calls make collaboration or casual hangouts effortless. With its cross-platform design and focus on privacy and control, Discord empowers users to build digital homes where meaningful conversations thrive — whether it’s a close-knit group of friends or a massive global community.",
    "size": 190,
    "reviews": 50000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 47000000 }
    ]
  },
  {
    "image": "/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 2,
    "description": "Spotify revolutionized how the world listens to music by bringing millions of tracks and podcasts right to your fingertips. With its clean design and smart recommendation engine, it helps users discover new artists, genres, and playlists tailored perfectly to their taste. Whether you’re working, studying, or relaxing, Spotify curates experiences that match every mood. The more you listen, the smarter it gets — suggesting songs and shows that feel personal and fresh every time. From global hits to local gems, Spotify bridges cultures through sound.\n\nBeyond streaming, Spotify has become a community-driven platform where creators and listeners connect. Features like collaborative playlists let friends build soundtracks together, while Spotify Wrapped celebrates your yearly listening journey. The platform also supports offline listening, so your favorite music travels with you wherever you go. For podcasters, Spotify offers powerful tools to create, publish, and grow audiences. It’s not just an app — it’s a personalized universe of sound that evolves with every play, skip, and favorite.",
    "size": 180,
    "reviews": 30000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 24000000 }
    ]
  },
  {
    "image": "/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "WhatsApp Messenger redefined personal communication by combining simplicity, speed, and security into one seamless experience. Built for billions of people around the globe, it allows users to send messages, make calls, and share photos, videos, and documents instantly. Its end-to-end encryption ensures that every conversation remains private, giving users confidence that their words and media are for their eyes only. From family chats to business groups, WhatsApp bridges distances and cultures with just a tap.\n\nThe app goes beyond texting — with features like voice and video calls, disappearing messages, and communities that make large-scale organization effortless. Users can sync across devices, send voice notes when typing isn’t an option, and share real-time locations to stay connected safely. WhatsApp Business further expands its ecosystem, letting companies communicate with customers in a personal yet professional way. Whether you’re checking in with friends or coordinating a global team, WhatsApp remains one of the world’s most trusted and essential communication tools.",
    "size": 120,
    "reviews": 150000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 127000000 }
    ]
  },
  {
    "image": "/instagram.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Instagram is where creativity meets connection. It started as a photo-sharing app but quickly evolved into a global platform where millions express themselves through visuals, stories, and conversations. From casual selfies to professional art, Instagram gives every user a stage to showcase their perspective on the world. Stories, Reels, and live streams make sharing life’s moments dynamic and spontaneous, while the Explore tab continuously inspires new ideas, creators, and trends.\n\nBeyond personal expression, Instagram has become a hub for culture, business, and discovery. Brands use it to reach audiences, creators build communities, and users find everything from fashion inspiration to life advice. With built-in shopping, messaging, and creator tools, it’s both a social network and a digital marketplace. The platform’s algorithm learns your interests, curating content that feels uniquely yours. Whether you’re documenting your journey or exploring someone else’s, Instagram turns everyday moments into stories worth sharing.",
    "size": 160,
    "reviews": 140000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 40000000 },
      { "name": "5 star", "count": 88000000 }
    ]
  },
  {
    "image": "/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description": "Snapchat reinvented how we share life — raw, real, and in the moment. Built on the idea that photos and messages don’t need to last forever, it encourages authentic connections free from the pressure of permanence. With its playful filters, Bitmojis, and creative lenses, every snap becomes a mini work of art. The app’s camera opens right to creativity, letting users instantly capture memories, share streaks with friends, or post spontaneous stories.\n\nBut Snapchat is more than fleeting fun — it’s a vibrant multimedia platform. The Discover section brings curated content from publishers, creators, and influencers, while Snap Map lets users explore the world through friends’ perspectives. AR technology transforms the experience, allowing you to interact with your environment in imaginative ways. With features like Spotlight, users can go viral and express themselves to millions. At its heart, Snapchat celebrates moments as they happen — imperfect, exciting, and alive.",
    "size": 150,
    "reviews": 25000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 14000000 }
    ]
  },
  {
    "image": "/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 6,
    "description": "TikTok is the heartbeat of modern entertainment, where creativity meets community in a never-ending stream of short videos. It gives everyone a platform to express themselves through music, humor, storytelling, and trends that spread globally within hours. The intuitive feed adapts instantly to what you love, learning from every swipe and like to create a deeply personal experience. Whether you're laughing at memes, watching tutorials, or discovering new artists, TikTok turns every moment into an opportunity for inspiration.\n\nBeyond watching, TikTok empowers you to create. With powerful editing tools, filters, and effects, anyone can produce polished, cinematic content straight from their phone. Its collaborative features — duets, stitches, and challenges — encourage people to interact creatively across continents. The platform celebrates diversity and individuality, bringing together millions of voices in one place. From viral dances to social commentary, TikTok has become a cultural hub where entertainment, education, and creativity collide, reshaping how the world communicates.",
    "size": 210,
    "reviews": 120000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 94000000 }
    ]
  },
  {
    "image": "/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 7,
    "description": "YouTube is the world’s largest stage for creativity, learning, and entertainment. It connects billions of people through videos that educate, inspire, and entertain — from quick tutorials to blockbuster documentaries. Whether you’re discovering music, watching live streams, or diving into niche interests, YouTube offers endless possibilities tailored to your curiosity. Its recommendation engine constantly refines itself to match your evolving tastes, creating a personalized experience that grows with you.\n\nFor creators, YouTube is a career platform. With monetization options, analytics, and community tools, it empowers individuals to build audiences and brands from scratch. Users can subscribe, comment, and interact in real-time, turning passive viewing into meaningful engagement. Premium features like ad-free playback, background listening, and downloads make the experience even smoother. Across every genre and language, YouTube remains the universal hub of visual storytelling — a place where anyone can share their vision and change how the world sees it.",
    "size": 200,
    "reviews": 160000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 128000000 }
    ]
  },
  {
    "image": "/twitter.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "X, formerly known as Twitter, is the pulse of real-time conversation — where news breaks first, opinions collide, and global movements begin. It’s a platform for instant expression, allowing users to share thoughts, media, and ideas in just a few words. Whether you’re following your favorite creators, staying updated on world events, or joining cultural debates, X keeps you connected to what’s happening right now. The simplicity of posting and the speed of interaction make it one of the most dynamic platforms in the digital world.\n\nWith features like Spaces for live audio discussions, Community Notes for context, and Threads for storytelling, X has grown beyond microblogging. It’s now a living ecosystem where journalists, brands, activists, and everyday users shape narratives in real time. Verified accounts and premium tools enhance visibility and engagement, while advanced search and analytics help users track trends as they unfold. X is not just a social media app — it’s where the world talks, reacts, and evolves together.",
    "size": 130,
    "reviews": 20000000,
    "ratingAvg": 4.0,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 9,
    "description": "Netflix has transformed entertainment forever by giving users the freedom to watch what they want, when they want. With a massive library of movies, series, documentaries, and anime, it caters to every taste — from thrilling dramas to heartfelt comedies. The platform’s intelligent recommendation engine learns from your viewing habits to suggest content that feels tailored to you. Whether you’re binge-watching an entire season or discovering hidden gems, Netflix delivers an experience that’s personal and immersive.\n\nBeyond streaming, Netflix is a creative powerhouse producing award-winning originals that rival Hollywood studios. Its global reach allows diverse stories to shine — from Korean thrillers to Spanish heists. Offline viewing ensures entertainment even on the go, and multi-profile support makes it easy for families to share without overlap. With seamless cross-device syncing, you can start a movie on your phone and finish it on your TV. Netflix isn’t just a streaming app; it’s a storytelling revolution redefining how the world experiences cinema.",
    "size": 250,
    "reviews": 100000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 78500000 }
    ]
  },
  {
    "image": "/reddit.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 10,
    "description": "Reddit is the internet’s living conversation — a network of millions of communities where curiosity thrives. It’s where people gather to discuss everything from science to memes, sports to philosophy, all organized into 'subreddits' that cater to every interest imaginable. Users can share ideas, stories, and humor, while upvotes and comments surface the most valuable contributions. Reddit’s design encourages open dialogue, making it one of the most authentic spaces online for unfiltered discussions.\n\nBeyond entertainment, Reddit is a source of knowledge, support, and inspiration. It’s where experts answer questions directly, niche communities celebrate shared passions, and strangers unite to solve real-world problems. The platform’s balance between anonymity and engagement fosters genuine interaction rarely seen elsewhere. With features like live chats, AMAs (Ask Me Anything), and awards for standout posts, Reddit feels like both a forum and a community hub. It’s not just social media — it’s the collective mind of the internet, always active and always evolving.",
    "size": 140,
    "reviews": 10000000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 6400000 }
    ]
  },
  {
    "image": "/trello.png",
    "title": "Trello",
    "companyName": "Atlassian",
    "id": 11,
    "description": "Trello makes productivity visual, flexible, and enjoyable. Designed around boards, lists, and cards, it transforms project management into an intuitive and collaborative experience. Each card represents a task that can move through different stages — from ideas to completion — giving you a clear overview of progress at every step. Whether you're managing a team project, organizing personal goals, or planning an event, Trello helps you see work unfold in real time.\n\nThe app’s drag-and-drop simplicity is powered by deep functionality. You can assign members, set due dates, attach files, and automate repetitive actions with Butler. Integrations with tools like Slack, Google Drive, and Jira keep your workflow connected. Its visual design encourages focus while reducing overwhelm, helping teams collaborate without chaos. Trello’s adaptability makes it equally useful for startups, classrooms, and large enterprises. It’s not just a task tracker — it’s a framework for clarity, teamwork, and creative organization that evolves with you.",
    "size": 90,
    "reviews": 1000000,
    "ratingAvg": 4.7,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 720000 }
    ]
  },
  {
    "image": "/airbnb.png",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 12,
    "description": "Airbnb transformed travel by turning the world into one big neighborhood. It connects millions of guests with hosts offering unique stays — from cozy apartments to castles, treehouses, and beachfront villas. The platform makes discovering new places as personal as it is adventurous. With powerful search filters, verified reviews, and 24/7 support, travelers can find homes that match their budget, style, and spirit. Whether you’re seeking comfort or creativity, Airbnb makes every journey feel local.\n\nBeyond accommodation, Airbnb helps users experience destinations authentically through Experiences — guided tours, workshops, and cultural activities hosted by locals. Hosts can showcase their passion, and guests can connect through shared stories and culture. The platform’s focus on trust, transparency, and belonging has reshaped hospitality itself. It empowers people to travel more meaningfully while helping communities thrive. Airbnb is not just about where you stay — it’s about how you experience the world.",
    "size": 180,
    "reviews": 20000000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 13500000 }
    ]
  },
  {
    "image": "/business.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 13,
    "description": "Microsoft Teams is the central hub for collaboration in the modern workplace. It unifies chat, meetings, calls, and file sharing into a single, powerful platform. Teams helps organizations communicate seamlessly — from quick one-on-one messages to large-scale video conferences. Its tight integration with Microsoft 365 allows you to co-edit documents, share presentations, and track tasks without ever leaving the app. Whether your team works remotely or in-office, Teams keeps everyone connected and productive.\n\nCustom channels and threaded conversations bring structure to communication, reducing clutter and ensuring every discussion has a home. With features like Together Mode, breakout rooms, and meeting transcriptions, Teams enhances collaboration with human-centered design. Security and compliance are built-in, making it ideal for enterprises that value data protection. From brainstorming sessions to daily check-ins, Microsoft Teams turns digital collaboration into a smooth, unified experience that empowers teamwork to thrive anywhere.",
    "size": 230,
    "reviews": 15000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "/gmail.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Gmail has become the gold standard for modern email — fast, secure, and intelligently organized. It goes beyond simple messaging to create a smarter communication experience. With advanced spam filters, powerful search, and AI-driven suggestions, Gmail helps users stay on top of conversations without the clutter. Its clean interface makes it easy to manage personal or professional emails, while categories like Primary, Social, and Promotions automatically sort incoming mail for clarity.\n\nIntegration with Google Workspace turns Gmail into a productivity powerhouse. You can schedule meetings, attach Drive files, start video calls via Meet, and collaborate seamlessly across tools. Smart Compose predicts your sentences, saving time and effort, while labels and filters offer total control over your inbox. Whether you’re handling client communication or planning a trip, Gmail ensures every message is easy to find and secure. With end-to-end reliability and tight synchronization across devices, it’s the email experience built for the modern world.",
    "size": 110,
    "reviews": 120000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 104900000 }
    ]
  },
  {
    "image": "/chatgpt.png",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 15,
    "description": "ChatGPT is your AI-powered companion for writing, learning, coding, and creativity. Built by OpenAI, it transforms how people think, work, and communicate by turning natural language into action. Whether you need to draft an essay, brainstorm ideas, debug code, or explain complex topics, ChatGPT provides intelligent, conversational assistance instantly. Its ability to understand nuance and context makes it more than a chatbot — it’s a personal productivity tool that adapts to your goals.\n\nThe app’s intuitive design allows users to chat naturally, switching between casual conversation and deep problem-solving with ease. Custom instructions and memory features help tailor responses to your preferred tone and purpose. Integrated with the web and various plugins, ChatGPT can access up-to-date information, generate images, and even help with document formatting. It’s ideal for students, professionals, and creators alike. By blending knowledge, reasoning, and creativity, ChatGPT acts as a tireless digital partner — one that learns with you, thinks with you, and helps you grow smarter every day.",
    "size": 120,
    "reviews": 25000000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 23200000 }
    ]
  },
  {
    "image": "/uber.png",
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "id": 16,
    "description": "Uber reimagined transportation by making rides accessible, fast, and reliable with just a tap. Whether you’re commuting to work, catching a flight, or heading out for dinner, Uber connects riders and drivers through a seamless, location-based platform. Real-time GPS tracking, transparent pricing, and multiple payment options create a stress-free experience from start to finish. Users can choose from economy rides to luxury cars, ensuring flexibility for every budget and occasion.\n\nBeyond rides, Uber has expanded into food delivery, parcel transport, and even electric bikes in select cities. The app’s user interface is designed for clarity — showing estimated fares, driver ratings, and arrival times before you confirm. Safety is a top priority, with 24/7 support, driver background checks, and share-trip options for peace of mind. Uber’s innovation continues with features like carpooling and eco-friendly ride choices, promoting sustainability while keeping cities moving. It’s not just about getting from point A to B — it’s about redefining how the world moves.",
    "size": 180,
    "reviews": 50000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 42000000 }
    ]
  },
  {
    "image": "/zoom.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 17,
    "description": "Zoom has become the go-to platform for virtual meetings, connecting people across continents in real time. Its blend of reliability, clarity, and ease of use makes online collaboration effortless. From business conferences to family catch-ups, Zoom brings people together through HD video, crisp audio, and intuitive controls. Participants can join meetings with a single link, share screens, chat, and record sessions for later reference — all without technical friction.\n\nZoom’s breakout rooms, virtual backgrounds, and webinar capabilities make it suitable for everything from classrooms to corporate events. Its focus on stability ensures smooth communication, even on low bandwidth. Security features like encryption, waiting rooms, and user authentication provide safe environments for all participants. Whether for remote work, education, or casual meetups, Zoom has become synonymous with connection. It’s more than a meeting tool — it’s a bridge that keeps relationships, teams, and ideas alive no matter where you are.",
    "size": 160,
    "reviews": 20000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 14500000 }
    ]
  },
  {
    "image": "/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 18,
    "description": "Telegram is built for fast, private, and secure communication — a messenger designed with power users in mind. With lightning-fast speed and cloud synchronization, it lets you chat across devices without ever losing data. You can send messages, photos, videos, and large files instantly, all protected by robust encryption. Telegram channels and groups support millions of members, making it ideal for communities, influencers, and organizations that need reliable large-scale communication.\n\nWhat sets Telegram apart is its focus on customization and innovation. Users can create bots, schedule messages, use custom themes, and even set up secret chats with self-destructing messages. Its open API allows developers to build creative extensions, ensuring the app evolves constantly. With no ads, no hidden costs, and complete respect for privacy, Telegram stands as a champion of digital freedom. It’s not just a messenger — it’s a full-fledged communication ecosystem built around speed, openness, and trust.",
    "size": 100,
    "reviews": 30000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 26000000 }
    ]
  },
  {
    "image": "/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 19,
    "description": "Pinterest is where inspiration lives — a visual discovery platform that helps users find ideas for every part of life. From recipes and fashion to home decor and travel, Pinterest turns curiosity into creativity. Each pin you save builds a personalized collection of dreams, goals, and projects. The app’s intelligent recommendation system suggests ideas tailored to your taste, helping you plan your next outfit, redesign your space, or even start a new hobby.\n\nWhat makes Pinterest special is how it turns discovery into action. Users can organize boards by theme, follow creators, and explore step-by-step guides. Its built-in shopping tools let you buy products directly from pins, turning imagination into reality. For brands and creators, Pinterest is a marketing powerhouse, driving engagement through visuals that inspire emotion and decision-making. Whether you’re planning your dream wedding, launching a creative project, or collecting ideas for later, Pinterest transforms imagination into tangible plans.",
    "size": 140,
    "reviews": 15000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "image": "/amazon.png",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 20,
    "description": "Amazon Shopping redefines convenience by putting the world’s largest marketplace in your pocket. With millions of products available across every category imaginable, it lets you browse, compare, and buy anything from electronics to groceries in seconds. Personalized recommendations help you discover deals that match your needs, while one-tap purchasing and reliable delivery options make shopping effortless. Prime members enjoy even faster shipping, exclusive discounts, and access to entertainment perks.\n\nBeyond retail, the app is built for trust and efficiency. Secure payment systems, real-time tracking, and easy returns ensure a worry-free experience. You can read verified reviews, ask questions, and even interact with sellers directly. The interface is optimized for quick navigation, making everything — from wishlists to order management — accessible in a few taps. Amazon Shopping isn’t just a store; it’s a global ecosystem of innovation, logistics, and customer satisfaction that makes online shopping feel personal, fast, and reliable.",
    "size": 180,
    "reviews": 120000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 105000000 }
    ]
  },
  {
    "image": "/paypal.png",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 21,
    "description": "PayPal is one of the world’s most trusted platforms for sending, receiving, and managing money securely. It revolutionized online payments by combining convenience, speed, and protection into a single experience. Whether you’re shopping online, paying friends, or managing business transactions, PayPal ensures every transfer is encrypted and safeguarded. Users can link cards or bank accounts, making payments seamless across apps, devices, and currencies. With buyer protection and dispute resolution, it gives confidence to millions of users around the world.\n\nBeyond peer-to-peer transfers, PayPal is a full financial ecosystem. It supports donations, subscriptions, and business invoices, empowering freelancers, entrepreneurs, and global brands alike. With features like Pay Later, instant transfers, and multi-currency wallets, it adapts to your financial lifestyle. The intuitive interface makes it easy to track activity and manage spending. Wherever money moves — across countries, platforms, or people — PayPal makes it faster, simpler, and safer.",
    "size": 110,
    "reviews": 8000000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5650000 }
    ]
  },
  {
    "image": "/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 22,
    "description": "Facebook remains the cornerstone of social connection, bringing billions of people together to share life’s moments, build communities, and discover new experiences. It’s where friendships grow, families stay in touch, and conversations shape culture. With features like posts, stories, live streams, and groups, Facebook gives users the tools to express themselves and engage meaningfully. The News Feed personalizes your experience, showing what matters most — from friends’ updates to trending discussions.\n\nBeyond social sharing, Facebook is a global platform for growth and discovery. Businesses use it to reach customers through targeted ads and marketplace listings, while creators build audiences with videos and reels. Events and Pages make organizing easy, while Messenger integration keeps communication instant and personal. Whether you’re connecting across continents or joining a local group, Facebook’s mission remains the same — to give everyone the power to build community and bring the world closer together.",
    "size": 180,
    "reviews": 180000000,
    "ratingAvg": 4.2,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 136000000 }
    ]
  },
  {
    "image": "/chrome.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 23,
    "description": "Google Chrome is the world’s most trusted browser — fast, secure, and designed for simplicity. Built on powerful technology, it ensures that every webpage loads quickly and safely, whether you’re streaming, shopping, or researching. Chrome’s minimalist interface hides complexity behind effortless usability, while sync features allow your bookmarks, passwords, and history to travel across all devices. It adapts to your workflow, giving you the speed and reliability needed to stay productive anywhere.\n\nSecurity is at Chrome’s core. With automatic updates, sandboxing, and phishing protection, it shields users from online threats. The built-in password manager and privacy controls help you browse with confidence. Developers benefit from robust tools for testing and optimizing web experiences. Extensions and themes let users customize the browser to fit personal needs — from productivity boosters to aesthetic tweaks. Chrome isn’t just a browser; it’s a gateway to the web that makes information accessible, fast, and secure for everyone.",
    "size": 170,
    "reviews": 100000000,
    "ratingAvg": 4.2,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 64500000 }
    ]
  },
  {
    "image": "/maps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 24,
    "description": "Google Maps is the ultimate navigation companion, guiding billions of users across the world with precision and ease. It offers turn-by-turn directions, real-time traffic updates, and public transit information to help you reach your destination faster. Whether you’re exploring new cities or finding the quickest route home, Maps adapts instantly to your journey. Satellite imagery, Street View, and 3D mapping provide an immersive understanding of any location on Earth.\n\nBut Google Maps goes beyond directions — it’s about discovery. Users can find nearby restaurants, attractions, and businesses with reviews, photos, and operating hours. Features like offline maps, location sharing, and personalized lists make planning effortless. For drivers, Maps offers live speed limits and route optimization, while businesses rely on it to attract local customers. It’s a blend of technology, geography, and human experience, turning navigation into exploration. Wherever you go, Google Maps helps you get there smarter, safer, and more confidently.",
    "size": 220,
    "reviews": 120000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 105000000 }
    ]
  },
  {
    "image": "/linkedin.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 25,
    "description": "LinkedIn is the world’s leading professional network, connecting millions of people to new opportunities, knowledge, and collaboration. It’s where careers grow and businesses thrive. Users can showcase their skills, share insights, and engage with industry leaders. The platform’s smart algorithms match talent with job openings, helping professionals take the next step in their careers. From startups to Fortune 500s, LinkedIn bridges the gap between ambition and achievement.\n\nBeyond job hunting, LinkedIn is a hub for learning and thought leadership. Creators post content that sparks conversation, while LinkedIn Learning provides courses to sharpen skills across industries. Recruiters use advanced tools to discover talent, and companies build brands that attract the right candidates. Messaging, events, and newsletters turn networking into a meaningful, ongoing experience. In a world where connections define success, LinkedIn remains the digital handshake that brings professionals together to learn, grow, and lead.",
    "size": 150,
    "reviews": 30000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 23700000 }
    ]
  }
]
